In [13]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [14]:
import boto3
client = boto3.client('ssm')
user=client.get_parameter(Name='redshift_user').get('Parameter')
password=client.get_parameter(Name='redshift_password').get('Parameter')
host='examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com'
port=5439

In [15]:
import os
os.environ['DATABASE_URL']='postgresql://{user}:{password}@{host}:{port}/dev'.format(**{
    'user':user['Value'],
    'password':password['Value'],
    'host':host,
    'port':port
})

In [16]:
%sql select * from sales limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
2 rows affected.

[(33095, 36572, 30047, 660, 2903, 1827, 2, Decimal('234.00'), Decimal('35.10'), datetime.datetime(2008, 1, 1, 9, 41, 6)),
 (88268, 100813, 45818, 698, 8649, 1827, 4, Decimal('836.00'), Decimal('125.40'), datetime.datetime(2008, 1, 1, 7, 26, 20))]

In [17]:
%sql select * from event limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
2 rows affected.

[(423, 303, 8, 1827, 'La Damnation de Faust', datetime.datetime(2008, 1, 1, 19, 30)),
 (1334, 208, 6, 1827, 'The King and I', datetime.datetime(2008, 1, 1, 14, 30))]

In [18]:
%sql select * from date limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
2 rows affected.

[(1827, datetime.date(2008, 1, 1), 'WE ', 1, 'JAN  ', '1    ', 2008, True),
 (1831, datetime.date(2008, 1, 5), 'SU ', 2, 'JAN  ', '1    ', 2008, False)]

%sql select * from users limit 2

### :::Total sales by Given CalDay/Month/year analysis:::

In [11]:
%%sql select sum(qtysold) total_qty_sold,caldate from sales s join date d 
on s.dateid=d.dateid
group by caldate 
order by sum(qtysold) desc limit 10

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
10 rows affected.

[(1216, datetime.date(2008, 7, 20)),
 (1198, datetime.date(2008, 9, 10)),
 (1187, datetime.date(2008, 10, 23)),
 (1173, datetime.date(2008, 9, 28)),
 (1171, datetime.date(2008, 8, 6)),
 (1170, datetime.date(2008, 2, 20)),
 (1160, datetime.date(2008, 9, 15)),
 (1158, datetime.date(2008, 7, 4)),
 (1158, datetime.date(2008, 10, 17)),
 (1154, datetime.date(2008, 6, 10))]

### Top 10 Buyers

In [29]:
%%sql
select u.username,u.firstname,s.qtysold,d.caldate from sales s join users u on 
s.buyerid=u.userid join date d
on s.dateid=d.dateid
order by qtysold desc
limit 10

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
10 rows affected.

[('BSN02SPX', 'Beverly', 8, datetime.date(2008, 3, 23)),
 ('DFD02LFG', 'Harrison', 8, datetime.date(2008, 3, 18)),
 ('LEM71QRL', 'Cole', 8, datetime.date(2008, 3, 3)),
 ('ORB21MOM', 'Hasad', 8, datetime.date(2008, 5, 4)),
 ('BNR06CAF', 'Genevieve', 8, datetime.date(2008, 3, 14)),
 ('EJT07WZV', 'Amelia', 8, datetime.date(2008, 2, 28)),
 ('RKR09VTF', 'April', 8, datetime.date(2008, 3, 18)),
 ('KTN76IOU', 'Ignacia', 8, datetime.date(2008, 3, 16)),
 ('XRE56IAJ', 'Garth', 8, datetime.date(2008, 1, 18)),
 ('VVD09UTT', 'Vaughan', 8, datetime.date(2008, 1, 13))]